OS-Q/A511/boards.txt
##############################################################

espectro32.name=ESPectro32

espectro32.upload.tool=esptool_py
espectro32.upload.maximum_size=1310720
espectro32.upload.maximum_data_size=327680
espectro32.upload.wait_for_upload_port=true

espectro32.serial.disableDTR=true
espectro32.serial.disableRTS=true

espectro32.build.mcu=esp32
espectro32.build.core=esp32
espectro32.build.variant=espectro32
espectro32.build.board=ESPECTRO32

espectro32.build.f_cpu=240000000L
espectro32.build.flash_size=4MB
espectro32.build.flash_mode=dio
espectro32.build.boot=dio
espectro32.build.partitions=default
espectro32.build.defines=

espectro32.menu.FlashMode.qio=QIO
espectro32.menu.FlashMode.qio.build.flash_mode=dio
espectro32.menu.FlashMode.qio.build.boot=qio
espectro32.menu.FlashMode.dio=DIO
espectro32.menu.FlashMode.dio.build.flash_mode=dio
espectro32.menu.FlashMode.dio.build.boot=dio
espectro32.menu.FlashMode.qout=QOUT
espectro32.menu.FlashMode.qout.build.flash_mode=dout
espectro32.menu.FlashMode.qout.build.boot=qout
espectro32.menu.FlashMode.dout=DOUT
espectro32.menu.FlashMode.dout.build.flash_mode=dout
espectro32.menu.FlashMode.dout.build.boot=dout

espectro32.menu.FlashFreq.80=80MHz
espectro32.menu.FlashFreq.80.build.flash_freq=80m
espectro32.menu.FlashFreq.40=40MHz
espectro32.menu.FlashFreq.40.build.flash_freq=40m

espectro32.menu.FlashSize.4M=4MB (32Mb)
espectro32.menu.FlashSize.4M.build.flash_size=4MB
espectro32.menu.FlashSize.2M=2MB (16Mb)
espectro32.menu.FlashSize.2M.build.flash_size=2MB
espectro32.menu.FlashSize.2M.build.partitions=minimal

espectro32.menu.UploadSpeed.921600=921600
espectro32.menu.UploadSpeed.921600.upload.speed=921600
espectro32.menu.UploadSpeed.115200=115200
espectro32.menu.UploadSpeed.115200.upload.speed=115200
espectro32.menu.UploadSpeed.256000.windows=256000
espectro32.menu.UploadSpeed.256000.upload.speed=256000
espectro32.menu.UploadSpeed.230400.windows.upload.speed=256000
espectro32.menu.UploadSpeed.230400=230400
espectro32.menu.UploadSpeed.230400.upload.speed=230400
espectro32.menu.UploadSpeed.460800.linux=460800
espectro32.menu.UploadSpeed.460800.macosx=460800
espectro32.menu.UploadSpeed.460800.upload.speed=460800
espectro32.menu.UploadSpeed.512000.windows=512000
espectro32.menu.UploadSpeed.512000.upload.speed=512000

espectro32.menu.DebugLevel.none=None
espectro32.menu.DebugLevel.none.build.code_debug=0
espectro32.menu.DebugLevel.error=Error
espectro32.menu.DebugLevel.error.build.code_debug=1
espectro32.menu.DebugLevel.warn=Warn
espectro32.menu.DebugLevel.warn.build.code_debug=2
espectro32.menu.DebugLevel.info=Info
espectro32.menu.DebugLevel.info.build.code_debug=3
espectro32.menu.DebugLevel.debug=Debug
espectro32.menu.DebugLevel.debug.build.code_debug=4
espectro32.menu.DebugLevel.verbose=Verbose
espectro32.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

lopy.name=LoPy

lopy.upload.tool=esptool_py
lopy.upload.maximum_size=1310720
lopy.upload.maximum_data_size=327680
lopy.upload.wait_for_upload_port=true

lopy.serial.disableDTR=true
lopy.serial.disableRTS=true

lopy.build.mcu=esp32
lopy.build.core=esp32
lopy.build.variant=lopy
lopy.build.board=LoPy

lopy.build.f_cpu=240000000L
lopy.build.flash_mode=dio
lopy.build.flash_size=4MB
lopy.build.boot=dio
lopy.build.partitions=default

lopy.menu.FlashFreq.80=80MHz
lopy.menu.FlashFreq.80.build.flash_freq=80m
lopy.menu.FlashFreq.40=40MHz
lopy.menu.FlashFreq.40.build.flash_freq=40m

lopy.menu.UploadSpeed.921600=921600
lopy.menu.UploadSpeed.921600.upload.speed=921600
lopy.menu.UploadSpeed.115200=115200
lopy.menu.UploadSpeed.115200.upload.speed=115200
lopy.menu.UploadSpeed.256000.windows=256000
lopy.menu.UploadSpeed.256000.upload.speed=256000
lopy.menu.UploadSpeed.230400.windows.upload.speed=256000
lopy.menu.UploadSpeed.230400=230400
lopy.menu.UploadSpeed.230400.upload.speed=230400
lopy.menu.UploadSpeed.460800.linux=460800
lopy.menu.UploadSpeed.460800.macosx=460800
lopy.menu.UploadSpeed.460800.upload.speed=460800
lopy.menu.UploadSpeed.512000.windows=512000
lopy.menu.UploadSpeed.512000.upload.speed=512000

lopy.menu.DebugLevel.none=None
lopy.menu.DebugLevel.none.build.code_debug=0
lopy.menu.DebugLevel.error=Error
lopy.menu.DebugLevel.error.build.code_debug=1
lopy.menu.DebugLevel.warn=Warn
lopy.menu.DebugLevel.warn.build.code_debug=2
lopy.menu.DebugLevel.info=Info
lopy.menu.DebugLevel.info.build.code_debug=3
lopy.menu.DebugLevel.debug=Debug
lopy.menu.DebugLevel.debug.build.code_debug=4
lopy.menu.DebugLevel.verbose=Verbose
lopy.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

lopy4.name=LoPy4

lopy4.upload.tool=esptool_py
lopy4.upload.maximum_size=1310720
lopy4.upload.maximum_data_size=327680
lopy4.upload.wait_for_upload_port=true

lopy4.serial.disableDTR=true
lopy4.serial.disableRTS=true

lopy4.build.mcu=esp32
lopy4.build.core=esp32
lopy4.build.variant=lopy4
lopy4.build.board=LoPy4

lopy4.build.f_cpu=240000000L
lopy4.build.flash_mode=dio
lopy4.build.flash_size=4MB
lopy4.build.boot=dio
lopy4.build.partitions=default

lopy4.menu.PSRAM.disabled=Disabled
lopy4.menu.PSRAM.disabled.build.defines=
lopy4.menu.PSRAM.enabled=Enabled
lopy4.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue

lopy4.menu.FlashFreq.80=80MHz
lopy4.menu.FlashFreq.80.build.flash_freq=80m
lopy4.menu.FlashFreq.40=40MHz
lopy4.menu.FlashFreq.40.build.flash_freq=40m

lopy4.menu.UploadSpeed.921600=921600
lopy4.menu.UploadSpeed.921600.upload.speed=921600
lopy4.menu.UploadSpeed.115200=115200
lopy4.menu.UploadSpeed.115200.upload.speed=115200
lopy4.menu.UploadSpeed.256000.windows=256000
lopy4.menu.UploadSpeed.256000.upload.speed=256000
lopy4.menu.UploadSpeed.230400.windows.upload.speed=256000
lopy4.menu.UploadSpeed.230400=230400
lopy4.menu.UploadSpeed.230400.upload.speed=230400
lopy4.menu.UploadSpeed.460800.linux=460800
lopy4.menu.UploadSpeed.460800.macosx=460800
lopy4.menu.UploadSpeed.460800.upload.speed=460800
lopy4.menu.UploadSpeed.512000.windows=512000
lopy4.menu.UploadSpeed.512000.upload.speed=512000

lopy4.menu.DebugLevel.none=None
lopy4.menu.DebugLevel.none.build.code_debug=0
lopy4.menu.DebugLevel.error=Error
lopy4.menu.DebugLevel.error.build.code_debug=1
lopy4.menu.DebugLevel.warn=Warn
lopy4.menu.DebugLevel.warn.build.code_debug=2
lopy4.menu.DebugLevel.info=Info
lopy4.menu.DebugLevel.info.build.code_debug=3
lopy4.menu.DebugLevel.debug=Debug
lopy4.menu.DebugLevel.debug.build.code_debug=4
lopy4.menu.DebugLevel.verbose=Verbose
lopy4.menu.DebugLevel.verbose.build.code_debug=5

